In [2]:
import pandas as pd
import sqlite3

In [3]:
# Create a connection to the SQLite database
conn = sqlite3.connect('stores.db')

# Create a cursor object to execute SQL queries
cursor = conn.cursor()

In [4]:

# Create a table in the database
cursor.execute('''CREATE TABLE sales_by_store (
transaction_id INTEGER, 
transaction_date DATE, 
transaction_time time without time zone, 
store_id INTEGER, 
staff_id INTEGER, 
customer_id INTEGER, 
instore_yn varchar(1), 
orders INTEGER, 
line_item_id INTEGER, 
product_id INTEGER, 
quantity_sold INTEGER, 
unit_price DOUBLE PRECISION, 
promo_item_yn VARCHAR(1)
);''')

# Commit the changes to the database
conn.commit()

In [5]:

# Create a table in the database
cursor.execute('''CREATE TABLE store (
	store_id INTEGER, 
	store_type VARCHAR (20), 
	store_square_feet INTEGER, 
	store_address  VARCHAR(150), 
	store_city VARCHAR(150), 
	store_state_province VARCHAR(150), 
	store_postal_code INTEGER, 
	store_longitude DOUBLE PRECISION, 
	store_latitude DOUBLE PRECISION, 
	manager INTEGER, 
	neighborhood VARCHAR(150)
);''')

# Insert data into the table

# Commit the changes to the database
conn.commit()

In [6]:
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table';", conn)

             name
0  sales_by_store
1           store

In [7]:
# Load data from a file into a table
df = pd.read_csv("./data/sales_by_store.csv")

In [8]:
df.head()

,transaction_id,transaction_date,transaction_time,store_id,staff_id,customer_id,instore_yn,order,line_item_id,product_id,quantity_sold,unit_price,promo_item_yn
0,1338,2017-01-01,7:06:11,5,30,5465,Y,1,1,32,2,3.0,N
1,399,2017-01-01,7:08:56,5,30,5895,Y,1,1,57,2,3.1,N
2,451,2017-01-01,7:14:04,5,26,5412,N,1,1,59,2,4.5,N
3,1170,2017-01-01,7:20:24,5,12,5676,Y,1,1,22,1,2.0,N
4,248,2017-01-01,7:22:41,5,30,5479,N,1,1,57,2,3.1,N

In [9]:
df.to_sql('sales_by_store', conn, if_exists='append', index=False)

OperationalError: table sales_by_store has no column named order

In [10]:
df.rename(columns={'order': 'orders'}, inplace=True)

In [11]:
df.to_sql('sales_by_store', conn, if_exists='append', index=False)

907841

In [12]:
# Load data from a file into a table
sdf = pd.read_csv("./data/stores.csv")
sdf.to_sql('stores', conn, if_exists='append', index=False)

4

In [13]:

# Create a connection to the SQLite database
#conn = sqlite3.connect('example.db')

# Read data from the "employees" table into a pandas DataFrame
df = pd.read_sql_query("SELECT * FROM stores", conn)
df

,store_id,store_type,store_square_feet,store_address,store_city,store_state_province,store_postal_code,store_longitude,store_latitude,manager,neigborhood
0,2,warehouse,3400,164-14 Jamaica Ave,Jamaica,NY,14232,-73.795168,40.705226,NaN,Jamaica
1,3,retail,2300,32-10 Sordway,Short Island City,NY,11506,-73.924008,40.761196,6.0,Astoria
2,5,retail,900,99 Lamb Street,New York,NY,11007,-74.010130,40.713290,16.0,Lower Manhattan
3,8,retail,1600,947 16th Avenue,New York,NY,20036,-73.990338,40.761887,31.0,Hell's Kitchen

In [14]:
pd.read_sql_query("SELECT distinct store_id FROM sales_by_store", conn)

   store_id
0         5
1         8
2         3

In [15]:

pd.read_sql_query("""CREATE INDEX idx_store ON sales_by_store (store_id);""", conn)

TypeError: 'NoneType' object is not iterable

In [ ]:
pd.read_sql_query("SELECT distinct store_id FROM sales_by_store", conn)

   store_id
0         3
1         5
2         8

In [36]:
#-- ÖSSZES Megrendelés, eladás összesítése
pd.read_sql_query("""SELECT SUM(orders) AS sum_orders, SUM(quantity_sold) AS sum_sold_qunatitiy, SUM(quantity_sold) / SUM(orders) AS avg_sold_qunatitiy FROM sales_by_store""", conn)

   sum_orders  sum_sold_qunatitiy  avg_sold_qunatitiy
0     1066573             1305637                   1

In [ ]:

-- Kerekítés
SELECT SUM(orders) AS sum_orders, SUM(quantity_sold) AS sum_sold_qunatitiy, round(SUM(quantity_sold)::decimal / SUM(orders), 2) AS avg_sold_qunatitiy FROM sales_by_store;

-- Ugyanez store-onkénti bontásban
SELECT store_id, 
	   SUM(orders) AS sum_orders, 
	   SUM(quantity_sold) AS sum_sold_qunatitiy, 
	   round(SUM(quantity_sold)::decimal / SUM(orders), 2) AS avg_sold_quantity 
FROM sales_by_store
GROUP BY store_id;

-- Tegyük mellé még az évet is a tranzakció időpontjából store-onkénti bontásban
SELECT store_id,
	   EXTRACT(year FROM transaction_date) AS year,
	   SUM(orders) AS sum_orders, 
	   SUM(quantity_sold) AS sum_sold_qunatitiy, 
	   round(SUM(quantity_sold)::decimal / SUM(orders), 2) AS avg_sold_quantity
FROM sales_by_store
GROUP BY 1,2
ORDER BY 1,2;

-- Számoljuk ki ugyanebben a bontásban a bevételeket is.
SELECT store_id,
	   EXTRACT(year FROM transaction_date) AS year,
	   SUM(orders) AS sum_orders, 
	   SUM(quantity_sold) AS sum_sold_qunatitiy, 
	   round(SUM(quantity_sold)::decimal / SUM(orders), 2) AS avg_sold_quantity,
	   round(SUM(quantity_sold * unit_price)::decimal, 2) AS revenue
FROM sales_by_store
GROUP BY 1,2
ORDER BY 1,2;

-- Nézzük meg, hogy hány egyedi vásárlótól jöttek ezek a bevételek
SELECT store_id,
	   EXTRACT(year FROM transaction_date) AS year,
	   SUM(orders) AS sum_orders, 
	   SUM(quantity_sold) AS sum_sold_qunatitiy, 
	   COUNT( customer_id),
	   round(SUM(quantity_sold)::decimal / SUM(orders), 2) AS avg_sold_quantity,
	   round(SUM(quantity_sold * unit_price)::decimal, 2) AS revenue
FROM sales_by_store
GROUP BY 1,2
ORDER BY 1,2;

-- Ellenőrzés
SELECT COUNT(distinct customer_id) FROM sales_by_store
WHERE store_id = 3
AND extract(year FROM transaction_date) = 2019;

-- Nézzük meg, hogy hány egyedi vásárlótól jöttek ezek a bevételek
SELECT sa.store_id,
	   EXTRACT(year FROM transaction_date) AS year,
	   st.store_city,
	   SUM(orders) AS sum_orders, 
	   SUM(quantity_sold) AS sum_sold_qunatitiy, 
	   COUNT( customer_id),
	   round(SUM(quantity_sold)::decimal / SUM(orders), 2) AS avg_sold_quantity,
	   round(SUM(quantity_sold * unit_price)::decimal, 2) AS revenue
FROM sales_by_store sa
INNER JOIN store st ON st.store_id = sa.store_id
GROUP BY 1,2,3
ORDER BY 1,2;

-- Van-e átfedés a boltok vásárlői között?
(SELECT customer_id FROM sales_by_store
WHERE store_id = 5)
INTERSECT
(SELECT customer_id FROM sales_by_store
WHERE store_id = 8);